# -*- coding: utf-8 -*-
"""Копия блокнота "Добро пожаловать в Colaboratory!"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1bVn7t1thJFceykOsldbC-iSpb-rWnpvr

Задача No57-61. Решение в группах
1. Прочесть с помощью pandas файл
california_housing_test.csv, который находится в папке
sample_data
2. Посмотреть сколько в нем строк и столбцов
3. Определить какой тип данных имеют столбцы
4. Проверить есть ли в файле пустые значения
5. Показать median_house_value где median_income < 2
6. Показать данные в первых 2 столбцах
7. Выбрать данные где housing_median_age < 20 и
median_house_value > 70000
8. Определить какое максимальное и минимальное
значение median_house_value
9. Показать максимальное median_house_value, где
median_income = 3.1250
10. Узнать какая максимальная population в зоне
минимального значения median_house_value


**Домашнее задание**

Задача 40
Работать с файлом california_housing_train.csv, который находится в папке
sample_data. Определить среднюю стоимость дома (median_house_value), где кол-во людей от 0 до 500 (population).

Задача 42:
Узнать какая максимальная households в зоне минимального значения population.
"""

import pandas as pd

df = pd.read_csv('sample_data/california_housing_train.csv')

"""Задача 40: Определить среднюю стоимость дома, где кол-во людей от 0 до 500 (population)"""

df[df['population'] < 500]['median_house_value'].mean()

"""Задача 42: Узнать какая максимальная households в зоне минимального значения population"""

df[df['population'] < df['population'].quantile(0.25)]['households'].max()

df.describe()

df.head()

df.tail()

df.shape

df.isnull()

df.isnull().sum()

df.dtypes

df.columns

df['latitude']

print(df['latitude'])
print(df['population'])

df[df['housing_median_age'] < 20]

df[(df['housing_median_age'] > 20) & (df['total_rooms'] > 2000)]

df[df['housing_median_age'] < 20]['total_rooms']

df[df['median_income'] < 2]

df[(df['housing_median_age'] < 20) & (df['median_house_value'] > 70000)]

print(df['population'].max())

print(df['population'].min())

print(df['population'].mean())

print(df['population'].sum())

df[['population', 'total_rooms']].median()

df[df['median_income'] == 3.1250]

df[df['median_income'] == 3.1250]['median_house_value'].max()

print(df[df['median_house_value'] < df['median_house_value'].quantile(0.25)]['population'].max())

import seaborn as sns

sns.scatterplot(data=df, x="longitude", y="latitude")

sns.scatterplot(data=df, x="households", y="population", hue="total_rooms")

sns.scatterplot(data=df, x="households", y="population", hue="total_rooms")

cols = ['population', 'median_income', 'housing_median_age', 'median_house_value']
g = sns.PairGrid(df[cols])
g.map(sns.scatterplot)

sns.relplot(x="latitude", y="median_house_value", kind="line", data=df)

sns.relplot(x = 'longitude', y = 'median_house_value', kind = 'line', data = df)

sns.scatterplot(data=df, x="latitude", y="longitude", hue="median_house_value")

sns.histplot(data=df, x="median_income")

sns.histplot(data = df, x = 'housing_median_age')

sns.histplot(data=df[df['housing_median_age']>50], x="median_income")

df.loc[df['housing_median_age'] <= 20, 'age_group'] = 'Молодые'
df.loc[(df['housing_median_age'] > 20) & (df['housing_median_age'] <= 50), 'age_group'] = 'Ср. возраст'
df.loc[df['housing_median_age'] > 50, 'age_group'] = 'Пожилые'

df.loc[df['median_income'] > 6, 'income_group'] = 'rich'

sns.displot(df, x="median_house_value", hue="income_group")